import random
import time
import json
from PIL import Image, ImageDraw, ImageFont
from os import path
import cv2
import numpy as np
import matplotlib.pyplot as plt
from random import choice

def choiceint(fr=0,to=255):
    return random.randint(min(fr,to), max(fr, to))
def create_text_image(words="Hello,你好！",
                      width=640, height=480,patch=32,
                      #
                      font_size=None,
                      text_color = None,
                      bg = None,
                      position=None,
                      return_format='pil'):
    """
    创建文字图像的函数。

    参数：
    - text：要显示的文本内容。
    - width：图像宽度。
    - height：图像高度。
    - font_path：字体文件路径。
    - font_size：字体大小。
    - text_color：文本颜色，以 RGB 元组形式表示。
    - position：文字在图像中的位置，以 (x, y) 元组形式表示。
    - return_format：返回格式，可选值为'pil'（默认，返回 PIL.Image 对象）或'opencv'（返回 OpenCV 格式的 numpy 数组）。

    返回：
    根据 return_format 参数返回相应格式的图像。
    """
    fn=str(round(time.time()*100))
    annos = {"version": "2.4.4",
                "flags": {},
                "shapes": [],
                "imagePath": fn + ".png",
                "imageData": "null",
                "imageHeight": height,
                "imageWidth": width
                }
    img = Image.new('RGB', (width, height), color=bg)
    draw = ImageDraw.Draw(img)
    bg = (255,255,255)
    for pw in range(0, width, patch):
        for ph in range(0, height, patch):
            # 设置文字
            index=random.randint(0,len(words)-1)
            text=words[index]
            # 设置大小和字体
            font_size = choiceint(10, patch)
            font_path = random.choice(["C:/Windows/Fonts/simsun.ttc",
                                       "C:/Windows/Fonts/simkai.ttf",
                                       "C:/Windows/Fonts/simHei.ttf",
                                       "C:/Windows/Fonts/SIMLI.TTF"])
            # font_path = "C:/Windows/Fonts/SIMLI.TTF"
            if path.exists(font_path):
                font = ImageFont.truetype(font_path, font_size)
            else:
                print("Font file not exists")
                return None
            # 设置颜色
            text_color = [choiceint(0, 255),
                          choiceint(0, 255),
                          choiceint(0, 255)]
            for i in range(3):
                if abs(text_color[i] - bg[i]) < 50:
                    text_color[i] = 155
            text_color = (text_color[0], text_color[1], text_color[2])
            # bg = [choiceint(0, 255),
            #       choiceint(0, 255),
            #       choiceint(0, 255)]
            # for i in range(3):
            #     if abs(text_color[i] - bg[i]) < 50:
            #         bg[i] = text_color[i] - 50
            #         if bg[i] < 0: bg[i] += 255

            # 设置文字位置
            position = (choiceint(0, patch - font_size),
                        choiceint(0, patch - font_size))

            # 获取文本的包围盒
            left, top, right, bottom = draw.textbbox((0, 0), text, font=font)
            text_width = right - left
            text_height = bottom - top

            # 检查文本是否超出图像范围
            x, y = position
            if x + text_width > pw + patch or y + text_height > ph + patch:
                # 如果超出，调整位置使其在图像范围内显示
                x = max(0, patch - text_width)
                y = max(0, patch - text_height)
            x,y = x + pw, y + ph
            draw.rectangle([(pw, ph), (pw + patch, ph + patch)], fill=bg)
            draw.text((x, y), text, font=font, fill=text_color)
            annos['shapes'].append({"label": text,
                                    "score": "null",
                                    "points": [[x,y+1],
                                               [x + text_width,y+1],
                                               [x + text_width,y + font_size+1],
                                               [x,y + font_size+1]],
                                    "group_id": "null",
                                    "description": "",
                                    "difficult": "false",
                                    "shape_type": "rectangle",
                                    "flags": {},
                                    "attributes": {},
                                    "kie_linking": []
                                    })
    img.save("E:/python/texts/" + fn+".png")
    with open("E:/python/texts/" + fn+".json", "w") as f:
        s = json.dumps(annos, indent=2)
        s = s.replace('"null"', 'null').replace('"false"','false')
        f.write(s)
    # if return_format == 'opencv':
    #     return cv2.cvtColor(np.array(img), cv2.COLOR_RGB2BGR)
    # elif return_format == 'pil':
    #     return img,x,y,font_size
    # else:
    #     return np.array(img)

if __name__ == '__main__':
    words="""qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM1234567890~!@#$%^&*()+=-\][;',./?><:"}{|乙一匕卜刀刁丁二了力入人又干才叉土川寸大勺凡廾孓己久弓口工及巾孑女乞廿尢千三山丫亡丸尸刃士夕已上巳小也于下兀之子弋丈巴分比卞不尺仇丑歹丹弔吊仃斗厄反介亢氏方勾勻丐互戈化乏今幻公父夫井木欠毛戶冗孔日內仁卅匹斤手切火什支牛毋升片勿午壬仍夭月兮少太水王犬屯爪心尹允四牙天刈文予引止爻尤友仄元中曰凹叭白半包北本平必弁丙布冊斥叱出司匆且代旦石冉叨氐叼叮冬禾伋功弗付弘可瓜叻古句叫市甘兄卡加刊甲立穴另令目末乎巧卉巨囚申丘矛史叩奴皿仞民叵奶占尼疋仟皮失丕示去仙他外五卯戊央矢母玄田幼未由甩它仕以印召生世矽札主玉左永瓦乍孕仗用只朮仔正匝右安仰扒百仳份并冰多宅臣丞吃弛她充圳舛次此存吋打地至汀丟帆而氾行耒伐伕仿耳奸舌合好圭圾匠阬尖妃朵灰艮囝共亙件各犯尬缶屹交伉回亥光列羽伏匡岌如劣牟乒老臼汍米任乓吉乩全旬吏牝企糸色六氖式考似寺危戎汁刎年西血曲戍向肉收有戌匈羊刑凶旭朱兇吐吸朽同凸妁圯吁汙名字死休守夙迆扔圩妄舟先因吆吒州伍自宇聿夷在再亦仲竹曳伊早衣旨兆呆呃吧伯伴孛貝庇妣佛釆杓別兵步佈材岑岔佔吵池車辰成呈盯赤呎沖助串床囪吹伺村忖但低弟佃甸佚甬豆杜妒兌妨坊估谷告究囤改即邑佝芣彷吩否汎汗更決汞灸均吟見冷孚忌杠杆位判坎甫吠囫肓扛坩牢吼含妞君宏角坑戒何卵忙罕里伽夾利困沍局求江攻汲扣李旱劫尿弧亨妓妊克伶吶完足七身劬吝沒牡妖弄免杗妙男良羌忍巡你豕汛屁宋杞杉序佞每吾托呂束姒辛刪吞汕岐妥圻攸抆彤巫牠私坍匣汝杏吱佗呀吻孝圬忘努希污矣尾妝汐妍役伸兕酉余我佑吳灼壯走形卮作佇皂住坐杖禿吮言佐冶址孜秀災妤姊呵哎艾奇岸昂把八爸杷佰版板扳扮並姅杯卑彼枇沘汴表秉併枋帛附兔昌尚長抄炒扯坼沉忱枕沈承侈泜祇妯扭初杵垂炊沌刺卒昕隹昔岱到受的底狄店典佻定咚東抖投枓竺泛亞扼岡抗居疙咎汽房玖汾非垃姑放忿孤炕姐呱奉咄玨糾果剁乖肯枉府官昆具劾氛臾扶沆咖汪其杲青亟兒咕儿呷狂快和固穹技刻虎斧阜卦坷例忽侖來肌昏軋刮彿疚屆赳佬庚況供季咐沬杭或肋抉歿妳金京侃屈昊苧卷帕冽找弩咀妾妮拋沛肩戕杼沁明戾念券咆呼佳奈孟呶帑庖空爬門幸汶劻忸批坤剌取杪命歧味呢疝姍兩甽枚抒妻虱些氓呻於岷枝社妹佺事始羋佩所沫欣坦沙宜盲卹汰坡林旺叔刷昇折汨呸牧姆坪忝委侍炎舍朋沐沃奄使秈協物臥乳析宛盂依祀帖享沂易姓岳佾玥咒佯弦杳刖沅直昀狀炙制抓夜咋罔岫往卓武侑怎侏爭忠忪知肴抑周雨宙宗哀拗拔疤拜拌抱保炮背怫波盃甭泵抨泌拂便扁砭封拚屏柄炳泊勃怕拍哺怖拆柵查差剎柴沾疢拖柢沱治重盅抽怵穿春促斫奏怛待怠殆毒抵帝牴約芍拈酊訂峒度肚段耑盾盹法飛盼風韭契缸建哇垓赴狗孩疥俊級拘勁姜俄曷迴虹柙肝姣負皈狙侯虺奐枸咳咯九恆前故宦革剋沸癸氟祈奎沮柯韋侷娃垠疳巷狐既徊哈垢矜拎紅看洸紀牯姦哄很枴紇芒架拒陘拐俐柑押冠砍沽肛訃皇界柳泓俘拉虻昤卻冒皆俚咧眇後姘柬厚俏觔虐怒姥枯竿哪趴抹河怩柒為盆軌泣計科荊亮后恰玟昧祕屎急叛耐秒炯紆品咬舢泡秋勉招泖某匍客衹泠玫泥是咪弭俞酋抿侶披染炬迺削美軍紉咩衫泄首哂毗甚眉咽食律芋侵拓泉袂拭祆炭頁庭陞拇泯沔南枰叟映胥香娜砂姚屍柔思怯室咦疫相閂牲俠泗突卸畏兗施庠姨陝柝恃畎玩耍帥亭泅係哉柚性威咸省剃侮咻歪信屋羿眨蚤沿柿怨沼畋狎則洶怏俗衍幽峙禺宣囿型要冑炫咫注爰胃柞昨咿帟泳垣奕俎宥籽姻彥怔者竽炸禹俑胄怡弈柱胤炤泱拄昭勇姿疣徉芝拙星昱紂油祉肘陣貞音殃咨姪政盈啊唉埃按俺案氨陰盎敖芭笆耙柏派班般舨梆旁紡豹剝砲倍俾狽畚俸秘服畢紕病拼玻亳埔睬財倉豺倡倀倘晁宸疹陳秤乘城翅持蚩恥臭畜祝芻郵純肫祠脆衰厝疸玳耽訑倒島洮娣砥玷凋挑爹釘洞恫凍桐蚪鬥哦峨峰俯芥拾掀疾砝核宮涇倣訐鬼活眩肥洱恩家羔姬芳肪脊砠拱函倥骨粉蚣根桁俱借紛剛個匪舫婀莢肺鬲躬朗罟股芬烘釜娌花哥屐倌恍洹狠柩害飢哩洽蚶倦陸桓訌耿倨疽桔軒唔哭娥徑洎格恢芙夏祖倚耕洪隻恐拷恪哼盍航挂哽恭拮矩狡浹逕氦津莖耗怪唧埂括烙貢肱洌珪租桂高倔酒桅華兼缺倪記晉挾砰峻桀秦桑崁候祗倆校烤哨峭娟恨畔們凌栗豈挈拿玲倩庫料涊芹痂珀倫芰洛紐眠埋秣連殺框氣留匿務耆射俳疲砌師偌烈敉芟娉屘哮娑能皰素脅洩扇訖納舐殊恤破迅時晒桃屑閃容紗恕晌神晏釙畝息浬衽託殉拳剖十弱索辱拴挺奚唐倖脩書徒莧虔梃耄軔洋倭洵洫娘這唆臬唏栓馬翁脈烏席玆育起迂芽配氧旅朔修肢胭祟邕甜洗栩娓蚊挖訊珊益圃狹拯娠紜氤訕峴秧浥峽舀疼紙窄討展狩砷訓迄訏孫紊蚜紋奘條衷泰殷冢芯笑恬娛拽砸特致套針耘恙洧祚徐晅唁烊窈酌祐砟洲宵圄站芷症峪宴原栽軏真值員宰效朕株准蚓芸悅恣砧莊指秩栘剜釗珍袁座桌挨崖庵盒菴捌敗彬絆邦崗苞胞袍被埤苯笨崩逼敝婢閉匾貶彪婊舶缽捕埠彩採參淺曹側赦涔斜釵產唱常徜娼悵萇巢紹趁晨淨匙豉敕笞移胝蛇崇涌舂絀處啜船釧唇脣瓷疵從族粗戚崔浚挫袋帶蛋啖啗啁鳥得笛隄唸涎彫釣涉窒頂動兜脰堆舵棻屝訪啡進瓠浩寂貨偽梵烽紼蛄基捍梗萊毫堊販婦啞返匐酣梡戛趺晦隊副翎訛紱珞敢苟豚軛芾符過階寄乾渦邢胡規苛婚訣健琍釩桿堝渠旌狷梨率凰堅掛崑剪海康救狼胛啃梱袈患痕勘淪假蛆娶貫苦釭浸焊蚵麥婁祭許硎強斛頃捫雀唬狸崛浮夠粒教圈涅匏苣徠胖彗烹捎苗國茄捆勒那袞眷票區皎捐悍崆曼盔畦笠茂培眶略涓悔掄淒鹿浦崙卿蚯密痊婆淚宿近將貧悽蛉羚苓梢啤胚旎牽聊偶扈阡犁珮覓浪捲茉梁竟啟茅冕麻釦啪徙術鹵流聆售偭崎悌捂婪徘苜舷毬脤訥望唳氫野您奢孰梂研浴視商梧捏偏眸設羞若敏爽悄堂粕鄉捨寇偎悚梅挽掃胎恿梭帷紳悟梳脫絃雪英偯祥苔偷痔眼敘焉眺邪苒組消偵現萵紲茆晚紫紮笙桶雩庶悠啕訟媧屜茁停剔軟袒崤晤笮貪婉捉琊袖晝梔異陽窕勗做域趾專訢械梓屠酗廷倏旋唯執終晞涕問扎崧烯習偉郾梯苑振庸圉責斬唾延悉尉唷細寅章痍訝敔迎帳蛀庾猙珠蚱堉啄張偕掙硃欲梟翌偺蛭週偃眾浙崢魚捱剴傲棍跋排阪鈑棒傍彭綁堡報裒悲焙邶備揹賁弼幅筆詖費跛博番發跑補采裁猜孱殘傖草策廁惻測曾茶接喳單敞猖場淌脹朝超鈔掣堪棧盛程啻喜喫飭惆鈕楮淑硫絮喘窗創捶椎淳荃茨嵯措茲詞淙湊淬悴皴最答迭達棣貸淡氮悼盜登等第堤迪邸詆惦奠蜓掉貂跌耋喋絰軼棟湩筒痘短敦防貳筏鈍斐絕焚琺楛揮飯畫渙控絞淦涪壺渾惇雋喟復鈇絡貴裂棚割袱茫筋傀捧扉喝廄凱掘聒戢鄗景嗟堠蒐喉給傅皖訶傢結減喊富黃棘焦荒窖棺間混馮幾悸閎猓椒皓胱胳距喀愒寒迦硬集痙捩啾晷杰傑揀蛟閒鈐棵鈣徨詁蛙淮蛤惡吭惚皋喚禍厥掬塊几葷賀荐嵌換街阱晶帽蛞雇辜極睏惠期鉅棄棋嵇稈蛐裡惑鈞描評喇筐違買就茴蛔喬荔琉竣牌媚喱戟鈉捻晾迫淋氯邱涵量貿理胼開茗淇窘軻絳捺荏祿莒瑯琅惱喪勞寐掠啦鄒嵐述涼剩普深欽殼掏阮啼閔情森跚腎邵婿翕腆崴喃涸棉清稅湯然涮幃黑痞無斯棲粟越欺飪痢硝俟稍迢瘦啣韌球毯絨散疏愜耜椅殖猛茹痛推巽悻跆赧覃晰絢焜媒尋善授舜淞硯液痠喔淫棠葦惟淅猶祁晴筍淘胸喂舒須項跎茸探塭葉圍茱惋粥悶堯廂飧徇犀壹惜順迤傘絛禽絲訴淆勝淤甥閏嫂統飩添胰虛惘萬掩氬酥診翔荀詐稀勛雄循咱棗涯淹掌寓雯証湲湧掖揚運詛雁飲詔蛛智爺淵哲棕喻隕替遊註幀喧云堰甦涿淄童棹詠閑婷貯象馭貼軸雅茵黍雲傚釉貽痣喲植媛尊脂阿矮乃愛暗鉗骯嗷奧媼靶湃斑頒徬刨雹鉋飽碑陂痺迸辟荸愎嗶媲鉍剽摒稟脖渤募鈸鉑鈽踩滄蒼插搽捷荼詫搓剷腸剿勦琛填湛嗆搶誠嗤提莉飾馳傭愁稠酬楚跦揣傳惴愴蠢揍催瘁搭塔靼塌迨遞馱詹誕當搗荻滌殿碘鈿電碉跳牒鼎渡堵督塗睪頓碓追節渴港跡概跺感莞琨貉蛾該陀詻躲詬煩惶稞痱湟溝漣畸揩嗑琿際勣跤揭豢經僇雊舅蓋楓閘賅嗯鉀荷愍惰猴會煌湖愕摑郃愣睢煥郝戡幹蓮筠賈蜂嫁彙揖詼愾鉤溉喙楷莆琯琥稜匯解較詰嫉迥頑慨跟靖綑揪郊鈷筧暇髡湔暉腳絹逅硿斡號酪毽晃話亂嘩詭雉僅湣幌脯裘睛愀廉鳩貊夢裊煎窟粱愷楫麂廊渺賃煉粳毀禁零夸硼蒞祺揆盟箝酩廓娩雷楠琴睫瓶賂琳琦誇楞莓敬跪睞游詩軾賄睥睨湄嗥聘搆窠慄渥傾睦逆援揉蜊莽滅鉚煤蓀惹嗎御勤迷路媽鈴蜆聖楣楝腦琵痳煆煨煞塢愆虜弒煖稔塞鈹蛻歲痲鼠勢遜群獅綏搔詮鉛塑琪試痿暑蜈嗣嗜筮握搜猩頌飼熄蜀愉嗓睡逃筵裙詨損嗇艇肆溼莘送裟農碗肅馴莫湍莎傷頊遙煙渭預義煦暖嫌熙嗉琶痰窩想歇輊嗡業蓆遝廈貲覜佣暍碎靴訾塘莠塒溫蔭渲衙羨嵩暄楔嗚嗦裝蛹嗅罩裕媳慍鉉蝓微渣照猥飴湘詢圓搖退蜃楊傯惺暈載賊煬資斟諍腫詳肄琢準稚阻塋椰睜裔愚煜榆鈾與暘盞意新楨虞湮郁雍詣塚渚遠蜇楹罪園誅渝瘀煮孳粵搾禎置債愈猷腌閡銨熬搬榜嘐悖菩鼻碧弊裨幣箄脾嫖彆賓鉼餅菠搏箔蔔駁僕溥誧菜綵慘慚臧嘈造僧察團嶄漸裳嫦嘗暢綽塵稱逞槍趟郢滯僮種溴綢裯蔥箠綴慈雌滋翠粹萃瘩瘍凳鄧嫡翟嘀逐適滇墊蜩趙碟逗睹端對餌綞孵菲箋閨嘎幗奪菔構罰愧鳳腐福餃齊鼓管降爾複歌墮腑腓逢漓廣菰蝕搞廖奩趕僭滑監嘉榦划酷兢暨酵裹閥裴跼蔣誥嫘菽匱僱蝸豪犒菅僑瘋郡盡甄瘓膏誨碣菱寡聚樺綾翡綸箕竭滬睽蜻槁頗菁逛菊綱槐溘誡嗨銬閣犖猾箇褂骷厲漢僥菌瑚瑙骰慣劃瑁閤截鉸塹腔槓鄰僚赫寞輕寬陌寥輔瑪雒鉻屢熒么滲榴蜜幕辣碰寧筷槨逵鳴精魂夥裸誑嘛魁鋁嫩髦滿膂郎瞄颯榮冥麼嶇誤瘧溜緊閭貍綠蜷蔆閩疑領暱溺伙需陋榷綺認劂滷滾蜢透墓限墅榔嫗仆境寢慝耶榕萌嘔暝溧槃瑞幔煽蜴榣通綿摟銘瑟碳搴敲署塾誚酸嗾塽歉誓褕榻算嘍萋惕瘟漬賒綬聞慟台餉瞇輓腕鞋慎隨寨菟臺熔壽菸寤說嗽銜網銑綰溶逝嫣溢颱滂萍旗緒碩瘉腴僩舔溪舞瑤瑣萄銓途劓維綜製蜿嘆實速艋榫墟榭瑕蜥誣綻搪銅鞅氳養鄭誦逍帚窪酴慇旖冤志厭萎腋逖態像銖溯毓僎獄撾榨肇漁鳶瑛源滕漲幛夤蜘萸圖瑜愿輒語箏粽緇墜賑嘖韶錚滔銀僖誘摭猿誌熊滓彰榛皚鞍醃噢澆罷瘢暴褒褓葆葡輩鋇奔陛陴蝙褊編標漂魄撥潑部撲槽漕增層嬋憚摻諂廠嘮徹瞋徵撐踟墀遲齒樁衝除廚著褚諸鋤幢瘡醇輟磁賜樅趣醋摧磋銼褡逮彈撢儅蕩稻導德嶝滴蒂敵締調蝶踢董陡嘟樞賭緞墦廢敷銳范橢輥樊劍盥膚範墳憤葛駕碾賡餓墩髮誹幡戮蝌銲撫踡葭劇踝毆穀磕獎澗慧瘠緘颳儉橄蝠頜撈稷犛篁緝蝦麩鋰潰葫駙腱稿駒郭落磊慷羯鴃緩槳糊嘰賤頫稽險稼賦噴價蝴嘿膠腹劊漿鋒麾箭鞏寮頡邁篌箴模慮畿瑰嬌挪摩款瞌熟嘹課儈論輪窮瑾漏諒慕僵噗輦樓漠貓樑褐輛踐踫澠憩蝗樂面磐褲瞑葩憐碼摺凜憫慶劉噙審駛翩窯黎歐諾輝遼罵墨靠練鬧潛緙駑葵暮鋪慼請踞髯撓履霉賠潔廟漫蝨魯熱嶔嫻噎撳盤誶慢瘤緯銻豎腿冪僻魅奭選霄賣餒貌撻摸寫確殤劈緲漆甌勰耦慫數輞摔慰誰潤衛嬈傻腰嬉賞褪艘遺震餘緬曄腥槭億瑭腮諛諄噓遷駝征陷漱嘶踏廝潯歎篇儂鴆躺蕪鋅諉撚憮鴉霆漪憂箸潠豌逶慾儀駟緹嫵閱賢腺談線嘻箱熨逸慵噪院銷皺漩毅牖質誼醉鄴樟緣暫駐漳瞎萱幟豬獐瑩陬漾賬輜潟樣摯影魷演葬摘噫噯諳懊澳聱辦辨磅螃鮑蓓憊壁篦瞥遍錶撇儐頻播膊潘蒲餐艙糙儕潺禪氅潮縐撤澈橙縝諶澄醒褫嘯熾憧潼儔醜撮踹陲錘踱輳錯璀蹉營壇擔潭噹擋燙道陶燈諦蹄靛澱雕諜錠都逾獨篤遁噸燉霏縫濩靜擭蒿澤薦鄂鋼縉澴暸遏檠餞噶墾獲錮萼霍獗輯翰翮骸冀鬨鍵奮陵橫舉劑駭諷諫撿錢寰璟橋磬餛勵篙縞頷還駱憬璣薑噩頸橇據鴣慌學機懍膈豭噤髻骼撩衡儘鍋薊龜瞰館燎糕罹橘噱錦彊錕縛鋸遑謊瞞噥曆扑膨龍潦縑螂燐積遇褸璘輻膩隍黔薔擄朴嬝謎陪穋擂霓錨賴錳糢諱澎窺璃濃錄瘺餡篛睿螟燃駢燜憔霖憑盧撕垮錡濛瞟頰褥瓢鞘橈歙靦簑撬燒穆親瘸蒙螞噬撒曉歷樵磧熹凝篩錫默頭膳霎磨蓉橡器樸撰擒儒諧遛融興謀潸憲鴒羲謂鴦蹂壅霑嶼蒜蓊蓄鴕燄勳頹曇薩輸豫遂篠筑璋諺擁磚螢焰澦蓑諭縣築穌濁餚赭錐憶戰隱頤穎嬴嘴擇撙燠樹緻撞整鴛蕭臻鴨謁諼閻憎蒸遐燕錙髭踵樽篆踴糖縈瘴縊覦諮癌隘曖璦遨襖豳闆幫謗臂繃蔽斃檗蹕濱擘擦蔡燦操澡澶毚償嚐濤瞠騁鯈黜儲歜鎚簇薺縱總聰趨黛澹憾檐膽檔盪蹈瞪磴點褶懂鍍鍛邇糞獷谿蟠繁簍鍔磺鍰燭隋環艱媾屨禮檢鮭豁璜儡濫講戲激駿闋顆尷轄礁轂鞠虧鍊爵燴覬壑磯臉檜嚎壕鮫壙癘撼擱鴿澧蟈購徽懇蔑擊賻颶燬糜瞭餽縷鎂縲膿闌嶺矯療臨績縵魎擠擴闊嚅罄舊濟濬輾縹磷繆璞嚇摹韓隆膾聯獰隸謨螫嬪鴻篾藍繅濂糠橾譁擬縮髁繈癆鍬彌斂鍥懋賽鼾襄麋鮪嶸甍嬤謄螻蔓嚀膜蟋黏懈聲擎燥檀濘謙螺糝遢燮遣孺澀蟒殮擅闈褽縿瞧霞檣縴擰濕曙謐霜禧瞳瞬膛蓿牆餵縯雖甕蹊螳臀蔚檄蟀鮮贅嚏蓬簌聳濰壓櫛賸嚮應黝蹋蟑翼餿謝翳醣氈優謠褻隅燧壎蔗鍾轅嶽輿擲嬰膺賺歟醞禦齋膝糟鍚翱擺鎊蹦鄙璧馥鞭邊殯臏檳蕃璨繒蟬瀋闖鎗痴抬離虫蟲檮礎雛槌戳叢藪蹙竄戴簞襠燾禱題鼕瀆斷顎翻鎬瞿簧濺檻蕙繙隔額豐鵠遘覲覆鎘濡丰藥燼雞闕犄簡壘鯀鵝曠穢醬鯽歸翹蕞濠騎嚕穫蹟櫃謹闔瞽簣朦瞼燸繭蕊餾攆癖霤鎳竅擾臍蕉懦釐蹣謬鵑繚繩蟯濮櫚濾蕨鯉檸瀏韹矇糧繞瓊鏈霧穠獵鎮鞣鬆鞦穡濯松雙璩蕈繕聶職鎖鎔擻瀉藷鯊顏櫂檯鎢曜懣耨蔬魍餮穗嬸魏軀觴瞻謫闐璿颺簪鄘黠鎰罈隙鄞颼醫雜鬃障擢彝轉蹤遮癒顓蠅擷燻遭織藝鼬礙藹鵪鏖薜瓣薄爆瀑簿曝襞鏢癟瀕簸蟾儳鏟鯧嘲帘懲癡疇櫥鶉鏃辭蹴蹲躂蹬鏑顛鯛胴櫝牘犢饉蹶蟻躉壞醮懶類疆鏗遴譎麗繪羹鏡鯨關轎瀨繳繫隴醱系薨鵬襤蘆懷鄱鯖羸藺譜爍攀鏍瀝麒胯靡瀘麓鬍襟譏轔廬臘難懵坏蕾簽礦饅簾鏝蟆識蘋湎壢櫓鏤獺譙礪獸蹼鵲蹺薯羅癢繹韜麴鵡穩蘇鏘蘊勸騖譆鏜羶璽蟹願嚥臃譚薇"""
    for _ in range(1000):
        create_text_image(words)


